Repository: JevgeniF/Distributed-Systems-dot-Net
Catalog: Cinesta/*.Resources/Identity.*.resx
Languages: et

source: Personal data
et: Isiklikud andmed

# manageYourAccount
source: Manage account
et: Seadista konto

# changeYourAccountSettings
source: Change account settings
et: Muuda konto andmed

source: Profile
et: Profiil

# passwrd
source: Password
et: Parool

# twoFactor
source: Two-factor authentication
et: Kaheastmeline sisselogimine

source: Close
et: Panna kinni

# changePasswrd
source: Change password
et: Muuda parooli

# currentPasswrd
source: Current password
et: Praegune parool

# newPasswrd
source: New password
et: Uus parool

# confirmNewPasswrd
source: Confirm new password
et: Kinnita uue parooli

# updatePasswrd
source: Update password
et: Uuenda parooli

source: Delete personal data
et: Kustuta isiklikud andmed

# deletePersonalDataNotice
source: Deleting this data will permanently remove your account, and this cannot be recovered.
et: Andmete kustutamine eemaldab ka sinu konto, ja seda ei saa taastada.

# deletePersonalDataButton
source: Delete data and close my account
et: Kustuta minu andmed ja pane kinni kasutajakonto

# lengthErrorMessage
source: The {0} must be at least {2} and at max {1} characters long.
et: {0} peab olema vähemalt {2} ja maksimum {1} märgi.

# passwrdDoesntMatchError
source: The new password and confirmation password do not match.
et: Uus parool ja parooli kinnitus on erinevad

source: Unable to load user
et: Ei saa laadida kasutajat

# passwrdChangedMessage
source: Your password has been changed.
et: Teie parool vahetatud.

# wrongPasswrd
source: Incorrect password
et: Vale parool

# unexpectedErrorDeletingUser
source: Unexpected error occurred deleting user.
et: Tundmatu viga kasutajakonto kustutamisel.

# disable2FA
source: Disable two-factor authentication (2FA)
et: Lülita välja kaheasmeline sisselogimine (2FA)

# disables2FAOnly
source: This action only disables 2FA.
et: See lülitab välja ainult 2FA.

# disabling2FAMessage
source: Disabling 2FA does not change the keys used in authenticator apps. If you wish to change the key used in an authenticator app you should
et: 2FA välja lülitamine ei vaheta võtmed, mis on kasutatud autentimise appis. Kui sa tahad vahetada need võtmed, siis sul vaja

# resetAuthenticatorKeys
source: reset your authenticator keys.
et: resettida autenteerimise võtmed.

# disable2FAShort
source: Disable 2FA
et: Lülita välja 2FA
